{
  "api": {
    "href": "https://api.czo.ooo/hmtpk"
  },
  "app": {
    "href": "https://vk.com/hmtpk_schedule",
    "shortName": "ХМТПК Расписание",
    "longName": "Расписание Ханты-Мансийского технолого-педагогического колледжа",
    "version": "v2.0"
  },
  "group": {
    "name": "Разработчики",
    "id": 218199825,
    "href": "https://vk.com/hmtpk_schedule_club"
  },
  "hrefs": {
    "college": "https://hmtpk.ru/ru"
  },
  "errors": {
    "Token": "Ошибка получения токена пользователя для выполнения запроса к ХМТПК API. Повторите попытку, если проблема не решится, сообщите разработчикам.",
    "APINotWorking": "Ошибка выполнения запроса к ХМТПК API. Повторите попытку позже, если проблема не решится, сообщите разработчикам.",
    "APIError": "Произошла ошибка в ХМТПК API. Повторите попытку позже, если проблема не решится, сообщите разработчикам.",
    "TimeoutExceeded": "Превышено время ожидания ответа от https://hmtpk.ru. Повторите попытку позже, если проблема не решится, сообщите разработчикам.",
    "RequestsTimeout": "Превышено количество запросов в секунду. Повторите попытку, если проблема не решится, сообщите разработчикам.",
    "TeacherIsNull": "Вы не выбрали преподавателя. Нажмите на кнопку \"Преподаватель\" в правом верхнем углу экрана и выберите преподавателя.",
    "GroupIsNull": "Вы не выбрали группу. Нажмите на кнопку \"Группа\" в правом верхнем углу экрана и выберите группу.",
    "GroupNotFound": "Группа не найдена.",
    "TeacherNotFound": "Преподаватель не найден.",
    "TeacherOrGroupIsNull": "Укажите свою группу или преподавателя для сохранения настроек."
  },
  "texts": {
    "NoLessons": "Нет занятий",
    "SelectSubgroup": "Выберите подгруппу",
    "TeacherSchedule": "Расписание преподавателя",
    "SelectUserType": "Выберите тип пользователя",
    "SelectGroup": "Выберите группу",
    "SelectTeacher": "Выберите преподавателя",
    "GroupSchedule": "Расписание группы",
    "Teacher": "Преподаватель",
    "Group": "Группа",
    "NotFound": "Ничего не найдено",
    "CheckSchedule": "Проверить расписание на сайте",
    "Share": "Поделиться",
    "SeptemberWarning": "Если нет занятий, то, может быть, информация о режиме учебных занятий и особенностях организации образовательного процесса доступна только по",
    "GroupOrTeacherNotFound": "Если вы не нашли нужную группу или преподавателя в списке, пожалуйста, сообщите об этом разработчикам. Для отправки обратной связи и уведомления об отсутствующих данных перейдите по следующей ссылке:",
    "Thanks": "Благодарим за ваше внимание и помощь в совершенствовании нашего приложения!",
    "AppInformation": "Приложение \"ХМТПК Расписание\" предоставляет максимально точное расписание, полученное непосредственно с официального сайта Ханты-Мансийского технолого-педагогического колледжа.",
    "CheckScheduleOnSite": "Вы можете проверить расписание, нажав на кнопку \"Проверить расписание на сайте\", и поделиться расписанием, нажав на кнопку \"Поделиться\".",
    "HowUseApplication": "Пользователи приложения могут использовать его как удобный инструмент для просмотра расписания и управления своим временем. Однако для получения официальной информации, такой как изменения в расписании или другие важные обновления, рекомендуется проверять официальный сайт колледжа.",
    "ErrorsOrInaccuracies": "стремятся обеспечить максимальную точность информации, но в случае обнаружения ошибок или неточностей, они готовы к оперативной их коррекции. Мы ценим взаимодействие с нашими пользователями и приглашаем вас сообщать о любых замеченных ошибках, предлагать улучшения и делиться вашим опытом. С вашей помощью мы сможем сделать наше приложение ещё лучше!",
    "OfficialSource": "является официальным источником информации о расписании, новостях и других официальных данных. Рекомендуется обращаться к этому официальному ресурсу для получения достоверной и актуальной информации.",
    "OfficialCollegeSite": "Официальный сайт Ханты-Мансийского технолого-педагогического колледжа",
    "SchedulePreparedIn1c": "Расписание занятий составляется в информационной системе «1С: Автоматизированное составление расписания», обновление происходит в автоматическом режиме."
  },
  "pages": {
    "Schedule": "Расписание",
    "TeacherSchedule": "Преподавателя",
    "GroupSchedule": "Группы",
    "MySchedule": "Мое",
    "Information": "О приложении",
    "Settings": "Настройки",
    "Announce": "Объявления",
    "News": "Новости",
    "College": "Колледж",
    "Abitur": "Абитуриенту"
  },
  "buttons": {
    "clear": "Очистить",
    "settings": "Настройки",
    "save": "Сохранить",
    "cancelAndClose": "Отмена и закрытие",
    "close": "Закрыть",
    "group": "Группа",
    "teacher": "Преподаватель"
  },
  "onboardings": {
    "one": {
      "title": "Добро пожаловать!",
      "subtitle": "Здесь вы найдёте расписание, которое берётся непосредственно с официального сайта колледжа."
    },
    "two": {
      "title": "Настройка вашего расписания",
      "subtitle": "Сначала выберите свою группу или преподавателя в настройках вашего расписания."
    },
    "three": {
      "title": "Ваше расписание",
      "subtitle": "Теперь вы можете легко просматривать свое расписание."
    },
    "four": {
      "title": "Меню приложения",
      "subtitle": "Используйте меню для навигации по приложению."
    },
    "five": {
      "title": "Расписание группы",
      "subtitle": "Здесь вы можете легко просматривать расписание любой группы."
    },
    "six": {
      "title": "Расписание преподавателя",
      "subtitle": "А здесь вы можете легко просматривать расписание любого преподавателя."
    },
    "seven": {
      "title": "Кнопки под расписанием",
      "subtitle": "Также вы можете поделиться расписанием и/или проверить его на сайте колледжа."
    }
  }
}